resources/public/startup-books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Startup Books</title>
<!-- 2018-04-26 Thu 13:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ed Babcock (greenyouse)" />
<meta  name="description" content="Hacks, projects, and general butt-kicking with Ed (greenyouse)"
 />
<meta  name="keywords" content="Clojure, ClojureScript, greenyouse, LISP" />
<meta name='viewport' content='width=device-width' initial-scale=1>
                     <link rel='shortcut icon' href='/img/favicon.ico' />
                     <link rel='stylesheet' href='/css/bootstrap.min.css' type='text/css'/>
                     <link rel='stylesheet' href='/css/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar navbar-default">
    <div class="container-fluid">
      <div class="navbar-header">
        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#main-navbar">
          <span class="sr-only">Toggle navigation</span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </button>
        <a class="navbar-brand" href="/index.html">Blog - Ed Babcock</a>
      </div>
      <div class="collapse navbar-collapse" id="main-navbar">
        <ul class="nav navbar-nav">
          <li><a href="/about.html">About</a></li>
          <li><a href="categories.html">Categories</a></li>
          <li><a target="_blank" href="https://github.com/greenyouse">Projects</a></li>

        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Startup Books</h1>
<p>
Most startup books aren't helpful. There isn't a repeatable solution
to how to succeed at a startup. While I worked for my startup I read
~30 general startup books to see if I could tease out applicable
nuggets of wisdom. Most of what I found was too general.
</p>

<p>
Startup books are like the self-help book industry. They aren't
helpful because the problem at hand is difficult. It requires a
solution that's very localized to your problem and can't just be
generalized into a silver bullet solution.
</p>

<p>
They feel like consultants trying to push some overly-complex "system"
for developing a successful business. The "solutions" are complicated
enough that you'll need to buy multiple books and subscribe to their
talks just to understand what they're trying to push. It's great for
the authors since they make more money and get consulting gigs, but
not so great for yourself&#x2026;
</p>

<p>
Here are the books that I found actually helpful. It's geared toward
initial product development because that's what I did.
</p>

<p>
startup founder books:
</p>
<ul class="org-ul">
<li>UX Strategy: How to Devise Innovative Digital Products
</li>
<li>The Founder's Dilemma
</li>
</ul>

<p>
Yup, it's a tiny list but out of all the books those are the only ones
that I would recommend without reservation.
</p>

<p>
UX Strategy teaches you how to apply UX research so you can build the
right product. You'll learn how to do basic things like validating
prototypes, cooking up a business model, and running a competitive
analysis.
</p>

<p>
As a software engineer with no previous background doing this sort of
thing, I found it invaluable. It shaped how I approached coming up
with ideas and testing them throughout the early part of the startup.
</p>

<p>
The second book, The Founder's Dilemma, is a reference book of the
major problems that the majority of startups go through. Each startup
may be building unique stuff but the process of building a startup
is 99% similar across companies. The book is detailed and dry so it's
not one to read through in one sitting.
</p>

<p>
It starts at the beginning problems you'll face pre-founding and goes
through later issues that span the life of a startup. The author
measured the choices that many real life startups made for each
problem and plots their results, so you get to see real-life data
about this. Having something grounded in statistics instead of just
talk was refreshing.
</p>

<p>
Every few months I'd have to re-open this book because I'd hit one of
the problems and things would go haywire. This made it a perfect
reference book for deciding what to do for hard problems.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Book Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
I have a habit of taking extensive notes on books and tech
talks as I'm going through them. There's a big file on my computer
with tens of thousands of lines from years of material.
</p>

<p>
To help other people going through (or about to go through) a similar
startup venture, I've put up my notes for the book.
</p>

<p>
<a href="books/ux-strategy.txt">Here are my notes for UX Strategy (org file format)</a>
</p>

<p>
This summary is like a lossy compression of the book
contents. Hopefully it pushes you to buy the actual book if you've
been thinking about doing a startup.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer> <hr />
                         <p><a href='http://creativecommons.org/licenses/by-nc-sa/3.0/' target='_blank'>©copyright 2015</a>, by <a href='/about.html'>Ed Babcock</a> (^_^)v</p>
                         </footer>
                         <script type='text/javascript' src='js/jquery.min.js'></script>
                         <script type='text/javascript' src='js/bootstrap.min.js'></script>
</div>
</body>
</html>